Tekla.Structures.Model.RebarLapping.LapPlacementEnum
The placement of the lap relative to the associated Tekla.Structures.Model.RebarLegFace.

Tekla.Structures.Model.RebarLapping.LapPlacementEnum.ON_LEG_FACE
On leg face.

Tekla.Structures.Model.RebarLapping.LapPlacementEnum.PERPENDICULAR_TO_LEG_FACE
Perpendicular to leg face.